package exam;

public class Operand {

	public static void main(String[] args) {
		// 연산자와 항
		// 항 (operand) : 연산에 사용되는 값
		// 연산자 (operator) : 항을 이용하여 연산하는 기호
		
		// 연산자의 종류
		// 1. 산술연산자
		
		// 2. 대입연산자
		//    - 변수에 값을 대입할때 사용하는 연산자 (=, +=, -=, *=, /=, %= 등)
		//  a = b : 변수 a에 b의 내용을 할당
		//  a += b : 변수 a에  b의 내용을 더한후 결과값을 할당
		//  a &= b : 변수 a에 변수 a와 b의 내용을 and 연산후 결과값 할당.
		//  a |= b : 변수 a에 변수 a와 b의 내용을 or 연산후 결과값 할당.
		//  a ^= b : 변수 a에 변수 a와 b의 내용을 xor 연산후 결과값 할당.
		
		// 3. 증감연산자
		// 4. 비교연산자
		//    - 피연산자 사이의 상대적 크기를 판단하는 연산자( ==, !=, >, >=, <, <= )
		
		// 5. 논리연산자( &&, || 등)
		//    * NOT 연산자 - 결과같의 반대로 출력 ex) 결과값이 True 일때 false 출력
		//  
		// 6. 삼항연산자, instanceof 연산자
		//    - 삼항연산자 ex) 조건문 ? true : false
	}      
}