package classExam;

public class OOP {

	public static void main(String[] args) {

		int result = function.calSum(100);
		System.out.println(result);
		
		// OOP(Object-Oriented Programming)
		// 객체지향 프로그래밍 : 모든 데이터를 객체로 취급하고 이 객체가 프로그래미응의 중심이되는 기법.
		// - 객체의 상태와 행동을 구체화하는 형태의 프로그래밍
		
		// 일상샐활의 객체를 표현
		
		// 절차지향 프로그래밍 : 시간과 사건의 흐름에 따른 프로그래밍
		
		// 일상생활에서의 객체
		// 학원에 올때 x다방 커피숍에서 아메리카노를 주문
		// 								아메리카노 => 객체가 될 수 있다.
		// 성적확인을 위해 학사관리 시스템에 로그인해서 수강한 과목들 성적확인
		//                              각 과목 => 객체가 될 수 있다.
		
		// 클래스 : 객체를 정의하는 틀, 혹은 설계도 
		// 자바에서는 이러한 틀인 클래스를 가지고 여러가지 객체를 생성하고 사용 
		// 클래스는 객체의 상태를 나타내는 필드와
		// 객체의 행동을 나타내는 메서드(method)로 구성한다.
		
	}

}
